# HeaderTextTypeId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSchedule..::..HeaderTextTypeId Property
ViewSchedule Class See Also
---
Defines the default text style used in the column headers in the body section of the schedule.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ElementId HeaderTextTypeId { get; set; }
```

Visual Basic
---
```text
Public Property HeaderTextTypeId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ HeaderTextTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The text type id doesn't represent a valid text type element. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace